Revit 2027 API
ReinforcementSettings.NumberingMethod Property
 Identifies the type of the numbering method.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReinforcementNumberingMethod NumberingMethod { get; set; }
Public Property NumberingMethod As ReinforcementNumberingMethod
	Get
	Set
public:
property ReinforcementNumberingMethod NumberingMethod {
	ReinforcementNumberingMethod get ();
	void set (ReinforcementNumberingMethod value);
}
member NumberingMethod : ReinforcementNumberingMethod with get, set
Property Value
ReinforcementNumberingMethod
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 This property can be used to modify the way that rebar sets with varying length bars are numbered.
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace